Repository: amikoamiko60/PeopleDirectory
Catalog: PeopleDirectory.DataContracts/Resources/ValidationMessages.*.resx
Languages: ka

# BirthDateInvalid
source: Individual must be at least 18 years old.
ka: პირი უნდა იყოს მინიმუმ 18 წლის.

# BirthDateRequired
source: Birth date is required.
ka: დაბადების თარიღი სავალდებულოა.

# CityIdRequired
source: City ID is required.
ka: ქალაქის იდენტიფიკატორი სავალდებულოა.

source: City not found.
ka: ქალაქი არ მოიძებნა.

# GenderInvalid
source: Gender must be either 'female' or 'male'.
ka: სქესის მნიშვნელობა უნდა იყოს "ქალი" ან "კაცი".

# GenderRequired
source: Gender is required.
ka: სქესი სავალდებულოა.

source: Individual not found.
ka: ადამიანი არ მოიძებნა.

# InvalidFile
source: File is invalid.
ka: ფაილი არასოწრია.

# NameInvalidCharacters
source: Name should contain only Georgian or Latin characters.
ka: სახელი უნდა შეიცავდეს მხოლოდ ქართულ ან ლათინურ სიმბოლოებს.

# NameMaxLength
source: Name cannot exceed 50 characters.
ka: სახელი არ უნდა აღემატებოდეს 50 სიმბოლოს.

# NameMinLength
source: Name must be at least 2 characters.
ka: სახელი უნდა შედგებოდეს მინიმუმ 2 სიმბოლოსგან.

# NameRequired
source: Name is required.
ka: სახელი სავალდებულოა.

# OneOrBothIndividualNotFound
source: One of both individual not found.
ka: ერთი ან ორივე პირი ვერ მოიძებნა.

# PersonalNumberInvalid
source: Personal number must be exactly 11 digits.
ka: პირადი ნომერი უნდა შეიცავდეს 11 ციფრს.

# PersonalNumberRequired
source: Personal number is required.
ka: პირადი ნომერი სავალდებულოა.

# PhoneNumberMaxLength
source: Phone number cannot exceed 50 characters.
ka: ნომერი არ უნდა აღემატებოდეს 50 სიმბოლოს.

# PhoneNumberMinLength
source: Phone number must be at least 4 characters.
ka: ნომერი უნდა შედგებოდეს მინიმუმ 4 სიმბოლოსგან.

# PhoneTypeInvalid
source: Phone type must be either 'mobile', 'office', or 'home'.
ka: ნომრის ტიპი უნდა იყოს "მობილური", "ოფისის" ან "სახლის".

# PhotoPathInvalid
source: Photo path is invalid.
ka: სურათის ფაილის მისამართი არასწორია.

# RelatedPersonTypeInvalid
source: Related person type must be 'colleague', 'acquaintance', 'relative', or 'other'.
ka: კავშირის ტიპი უნდა იყოს "კოლეგა", "ნაცნობი", "ნათესავი" ან "სხვა".

source: Relationship already exists.
ka: კავშირი უკვე არსებობს.

source: Relationship not found.
ka: კავშირი არ მოიძებნა.

# SurnameInvalidCharacters
source: Surname should contain only Georgian or Latin characters.
ka: გვარი უნდა შეიცავდეს მხოლოდ ქართულ ან ლათინურ სიმბოლოებს.

# SurnameMaxLength
source: Surname cannot exceed 50 characters.
ka: გვარი არ უნდა აღემატებოდეს 50 სიმბოლოს.

# SurnameMinLength
source: Surname must be at least 2 characters.
ka: გვარი უნდა შედგებოდეს მინიმუმ 2 სიმბოლოსგან.

# SurnameRequired
source: Surname is required.
ka: გვარი სავალდებულოა.

# UnexpectedErrorMessage
source: Unexpeted error.
ka: გაუთვალისწინებელი შეცდომა.

# UnsupportedFileFormat
source: File format is unsupported.
ka: ფაილის ფორმატი არ არის დაშვებული.
